
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14943180697)



<pre><code>Apply complete! Resources: 0 added, 4 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zero_trust_tunnel_cloudflared.gate: Refreshing state... [id=25367332-dec7-40f7-afff-0d97c8a68f3a]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_tunnel_cloudflared_config.gate: Refreshing state... [id=25367332-dec7-40f7-afff-0d97c8a68f3a]
cloudflare_dns_record.cname_blog_ruzicka_dev: Refreshing state... [id=40b2f2c58767f934a85dd09857036003]
cloudflare_dns_record.spf_txt_ruzicka_dev: Refreshing state... [id=37c6dd1d4f442313753b992ef048ab84]
cloudflare_dns_record.mx3_ruzicka_dev: Refreshing state... [id=dc2ccc3ddf800440e8cb36b2750628ff]
cloudflare_dns_record.mx2_ruzicka_dev: Refreshing state... [id=998e7ce6783759477c42e79b700f2a2b]
cloudflare_dns_record.txt_github_pages_challenge_ruzickap_ruzicka_dev: Refreshing state... [id=3278fdec9a5bee7946a9d4cd65dc7645]
cloudflare_dns_record.mx1_ruzicka_dev: Refreshing state... [id=72c3096bb3dfbbea638b11ec6a9084f1]
cloudflare_dns_record.cname_stats_ruzickap_github_io_ruzicka_dev: Refreshing state... [id=4e6ec427d1f22a61d21b3e6e401d9475]
cloudflare_dns_record.cname_ruzicka_dev: Refreshing state... [id=6012deab4c329d17d2c64685ab381aa1]
cloudflare_dns_record.cname_petr_ruzicka_dev: Refreshing state... [id=560582f3686f60730649302acc4a54f6]
cloudflare_dns_record.txt_cf2024_1_domainkey_ruzicka_dev: Refreshing state... [id=a21bd05ef17e1277f9f0ec1756b8f320]
cloudflare_dns_record.cname_www_ruzicka_dev: Refreshing state... [id=54daa51645ec0c8268be734d23ff39ea]
cloudflare_dns_record.mx2_mylabs_dev: Refreshing state... [id=3224096c7ca0547917f9c0026aa65f88]
cloudflare_dns_record.ns4_k8s_mylabs_dev: Refreshing state... [id=edeb28878e93de06491a321036737864]
cloudflare_dns_record.cname_mylabs_dev: Refreshing state... [id=512175704937e92cfc53a4711bcfba1a]
cloudflare_dns_record.ns1_k8s_mylabs_dev: Refreshing state... [id=bb4675cb0c3a2fcb29cec8d26a466d54]
cloudflare_dns_record.ns2_aws_mylabs_dev: Refreshing state... [id=c09981c61ebf3756ff5f717ced460d7c]
cloudflare_dns_record.ns2_k8s_mylabs_dev: Refreshing state... [id=735395882005c878dfcfdaa0fc3c0b4a]
cloudflare_dns_record.mx3_mylabs_dev: Refreshing state... [id=54c0a1c1eca296a1e1449ef5300fe3d2]
cloudflare_dns_record.cname_www_mylabs_dev: Refreshing state... [id=d3feaa152c14f6f38c69d384ba4f5111]
cloudflare_dns_record.ns3_aws_mylabs_dev: Refreshing state... [id=d207b2188295decc79b025a03bbd5928]
cloudflare_dns_record.txt_cf2024_1_domainkey_mylabs_dev: Refreshing state... [id=8820748f17e5b98fb90dd2caf4b51711]
cloudflare_dns_record.ns1_aws_mylabs_dev: Refreshing state... [id=fdb99a821d84d9685861804054b04cf9]
cloudflare_dns_record.spf_txt_mylabs_dev: Refreshing state... [id=12b0353211ea68f2e01d41c96582087a]
cloudflare_dns_record.ns4_aws_mylabs_dev: Refreshing state... [id=9bdfd9d4ad07b2946910408a7abbf540]
cloudflare_dns_record.mx1_mylabs_dev: Refreshing state... [id=83cf9c058c96fce13afbf648b00891a5]
cloudflare_dns_record.ns3_k8s_mylabs_dev: Refreshing state... [id=8409985e399eb9ff87bb26e9663b8903]
data.http.my_file: Read complete after 1s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=45069e77-095c-462c-86d7-98fa9731a0da]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_application.msr_2: Refreshing state... [id=27f161c0-271d-4df1-a001-c4bb1c5fb1ea]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.msr_2 will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "msr_2" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "0c604237dc727565526218aecc4e5b725c5b434b0d77ea929f5c436983300438" -> (known after apply)
      ~ created_at                   = "2025-05-10T06:44:02Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2-2.mylabs.dev" -> null
            },
        ] -> null
        id                           = "27f161c0-271d-4df1-a001-c4bb1c5fb1ea"
      + landing_page_design          = (known after apply)
        name                         = "msr-2-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2-2.mylabs.dev",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "iot",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-10T07:13:37Z" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "1a36ca86-d5c6-4e00-b003-006e2034fff3"
        name        = "My Test Google IDP - 2"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2c8404fb-81ca-4bab-835f-b933c0649e90"
        name             = "Google SSO Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-10T07:13:36Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
        name             = "UptimeRobot Direct Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-10T07:13:36Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifying... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.google_sso_access: Modifying... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifying... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifications complete after 0s [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifications complete after 0s [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_policy.google_sso_access: Modifications complete after 4s [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_application.msr_2: Modifying... [id=27f161c0-271d-4df1-a001-c4bb1c5fb1ea]
cloudflare_zero_trust_access_application.msr_2: Modifications complete after 0s [id=27f161c0-271d-4df1-a001-c4bb1c5fb1ea]

Apply complete! Resources: 0 added, 4 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":191,"Program":"tfcmt","SHA1":"8fb89eed6564ea4f7469fb64f63b46509bdd7235","Vars":{},"WorkflowName":"tofu-cloudflare"} -->